# coding=utf-8

timeFormat_tooltip = "<br>".join((
    "Формат - Значення",
    "%a - Скорочена назва дня тижня",
    "%A - Повна назва дня тижня",
    "%b - Скорочена назва місяця",
    "%B - Повна назва місяця",
    "%c - Дата та час",
    "%d - День місяця [01,31]",
    "%H - Час (24-год. формат) [00,23]",
    "%I - Час (12-год. формат) [01,12]",
    "%j - День року [001,366]",
    "%m - Номер місяця [01,12]",
    "%M - Кількість хвилин [00,59]",
    "%p - До полудня або після (при 12-годинному форматі)",
    "%S - Кількість секунд [00,61]",
    "%U - Номер тижня в році (0 тиждень починається з неділі) [00,53]",
    "%w - Номер дня тижня [0(Sunday),6]",
    "%W - Номер тижня в році (0 тиждень починається з понеділка) [00,53]",
    "%x - Дата - у форматі системної локалі",
    "%X - Час - у форматі системної локалі",
    "%y - Рік без століття [00,99]",
    "%Y - Рік зі століттям",
    "%Z - Назва часового поясу (без символів, якщо часовий пояс не існує).",
    "%% - Знак '%'"
))

RESTART_TOOLTIP = "Для увімкнення/вимкнення необхідний перезапуск гри."

localization = {
    "configSelect": {
        "header": "Варіанти налаштувань",
        "selector": "Обрати налаштування:",
        "donate_button_ua": "MONO Банка",
        "discord_button": "Discord сервер модифікації",
        "reload_config": "Перезавантажити налаштування",
    },
    "main": {
        "header": "Налаштування без категорії",
        "DEBUG_MODE": "Режим налагодження (не вмикати без потреби)",
        "anti_anonymous": "Позначати гравців із прихованим нікнеймом",
        "clear_cache_automatically": "Автоматично очищати кеш після виходу з гри",
        "clear_cache_automatically_tooltip": "Очищення тимчасових файлів гри у: AppData/Roaming/Wargaming.net/WorldOfTanks",
        "auto_crew_training": "Автоматично перемикати 'Пришвидшене навчання екіпажу'",
        "auto_crew_training_tooltip": "Відстежує, чи прокачана/доступна 'Польова модернізація', і вмикає або вимикає 'Пришвидшене навчання"
                                      " екіпажу' залежно від цього.",
        "auto_return_crew": "Автоматичне повернення екіпажу",
        "auto_return_crew_tooltip": "Якщо на вибраному танку немає екіпажу, але він є в наявності та не перебуває в бою на іншому танку,"
                                    " то екіпаж буде повернено в танк автоматично.",
        "disable_score_sound": "Вимкнути звук при знищенні союзного або ворожого танка",
        "disable_stun_sound": "Вимкнути звук оглушення артилерією",
        "directives_only_from_storage": "Заощаджувати бони та срібло на купівлі настанов",
        "directives_only_from_storage_tooltip": "Запобігає автоматичному поповненню настанов за бони або срібло, якщо їх немає на складі."
                                                " Також модифікація увімкне галочку 'Автоматичне поповнення', якщо настанови є в запасі.",
        "hide_badges": "Вимкнути відображення нашивок у бою",
        "hide_badges_tooltip": "Відключає значки в вухах, вікні по Tab та на екрані завантаження.",
        "hide_clan_abbrev": "Приховати теги кланів у бою",
        "hide_button_counters_on_top_panel": "Вимкнути лічильники та підказки на кнопках у шапці гаража.",
        "hide_button_counters_on_top_panel_tooltip": RESTART_TOOLTIP,
        "hide_dog_tags": "Вимкнути відображення жетонів у бою",
        "hide_field_mail": "Вимкнути польову пошту",
        "hide_hint_panel": "Приховати підказки в бою",
        "hide_main_chat_in_hangar": "Вимкнути спільний чат у гаражі",
        "hide_main_chat_in_hangar_tooltip": RESTART_TOOLTIP,
        "ignore_commanders_voice": "Ігнорувати озвучку командирів",
        "ignore_commanders_voice_tooltip": "Після активації буде примусово використовуватися стандартна озвучка екіпажу. Цей параметр "
                                           "замінить унікальні голоси командирів на стандартну озвучку або встановлений мод.",
        "premium_time": "Відображати таймер преміум-аккаунту",
        "premium_time_tooltip": "Увімкнення або вимкнення відбувається не миттєво—потрібно зачекати до 1 хвилини або змінити вкладку гаража.",
        "show_friends": "Позначати друзів і членів клану у списках команд",
        "useKeyPairs": "Використовувати парні клавіші Ctrl, Alt і Shift",
        "useKeyPairs_tooltip": "Після активації ліва та права клавіші працюватимуть як одна, незалежно від налаштувань модуля.",
        "save_shot": "Блокувати стрілянину по союзниках та знищених танках",
        "mute_team_base_sound": "Вимкнути сирену захоплення бази",
        "hide_prestige_hangar_widget": "Приховати віджет елітних рівнів в ангарі",
        "hide_prestige_battle_widget": "Приховати віджет елітних рівнів у бою",
        "hide_prestige_profile_widget": "Приховати віджет елітних рівнів у профілі гравця",
        "excluded_map_slots_notification": "Сповіщати про доступні слоти для вилучення мап",
        "auto_claim_clan_reward": "Автоматично збирати кланові нагороди",
        "hideEventBanner": "Вимкнути банери подій"
    },

    "statistics": {
        "header": "Налаштування статистики гравців та іконок танків",
        "icons": "Іконки: Перефарбування у кольори класів техніки",
        "icons_tooltip": "Ця функція змінює кольори всіх іконок техніки на екрані завантаження, у вухах та у вікні, що відкривається "
                         "клавішею Tab. Фільтр впливає на яскравість. Рекомендована сила фільтра: -1.25.",
        "icons_blackout": "Іконки: Інтенсивність фільтра (яскравість)",
        "statistics": "Увімкнути статистику гравців за рейтингом WGR",
        "statistics_vehicle_name_color": "Змінювати колір назви танка у списках відповідно до статистики гравця",
        "statistics_tooltip": "Статистика відображатиметься на екрані завантаження, у вухах та у вікні, що відкривається клавішею Tab."
                              " Для точнішого налаштування використовуйте файл statistics.json. Доступні макроси: WGR, colorWGR, "
                              "winRate, nickname, battles, clanTag.",
        "statistics_colors*very_bad": "Дуже низький рівень",
        "statistics_colors*bad": "Низький рівень",
        "statistics_colors*normal": "Середній рівень",
        "statistics_colors*good": "Високий рівень",
        "statistics_colors*very_good": "Дуже високий рівень",
        "statistics_colors*unique": "Унікальний рівень",
        "statistics_panels_full_width": "Ширина поля імені гравця (широкі вуха)",
        "statistics_panels_cut_width": "Ширина поля імені гравця (вузькі вуха)"
    },
    "dispersion_circle": {
        "header": "Налаштування кола зведення, серверного прицілу",
        "server_aim": "Увімкнути серверний приціл (додаткове коло)",
        "server_aim_tooltip": "Увімкнення функції створить додаткове коло зведення серверного прицілу.",
        "replace": "Замінити оригінальне коло зведення",
        "scale": "Множник розміру кола 30-100% (0.3-1.0)",
        "scale_tooltip": "Даний параметр впливає на те, яким буде додаткове коло зведення у підсумку. "
                         "Якщо значення становить 0.3 (30%), то коло буде мінімально можливим, "
                         "а при 1.0 (100%) - максимально, тобто без змін. Як на замовчення. "
                         "Не рекомендується встановлювати значення менше 0.6 (60%).",
    },
    "dispersion_timer": {
        "header": "Налаштування таймера зведення",
        "x": "Горизонтальне розташування",
        "y": "Вертикальне розташування",
        "color": "Колір: Не зведено",
        "done_color": "Колір: Зведено повністю",
        "align": "Вирівнювання тексту",
        "timer": "Показувати залишок часу",
        "percent": "Показувати відсоток"
    },
    "effects": {
        "header": "Налаштування візуальних ефектів",
        "noShockWave": "Вимкнути вібрацію камери при влучанні по танку",
        "noFlashBang": "Прибрати спалах при отриманні пошкоджень",
        "noBinoculars": "Прибрати затемнення у режимі снайпера",
        "noSniperDynamic": "Вимкнути динамічну камеру в режимі снайпера"
    },
    "debug_panel": {
        "header": "Налаштування панелі FPS та PING",
        "fpsColor": "Колір показника FPS",
        "pingColor": "Колір показника PING",
        "style": "Стиль панелі",
    },
    "battle_timer": {
        "header": "Налаштування таймера бою",
        "timerTemplate": "Поле для форматування таймера",
        "timerTemplate_tooltip": "Доступні макроси:<br>%(timer)s - Таймер<br>%(timerColor)s - Колір таймеру.",
        "timerColorEndBattle": "Колір макроса %(timerColor)s: залишається менше 2 хв.",
        "timerColor": "Колір макроса %(timerColor)s: більше 2 хв."
    },
    "clock": {
        "header": "Налаштування годинника в гаражі та бою",
        "battle*enabled": "Годинник в бою",
        "battle*format": "Годинник в бою: форматування",
        "battle*format_tooltip": timeFormat_tooltip,
        "battle*x": "Годинник в бою: позиція по горизонталі",
        "battle*y": "Годинник в бою: позиція по вертикалі",
        "hangar*enabled": "Годинник в гаражі",
        "hangar*format": "Годинник в гаражі: форматування",
        "hangar*format_tooltip": timeFormat_tooltip,
        "hangar*x": "Годинник в гаражі: позиція по горизонталі",
        "hangar*y": "Годинник в гаражі: позиція по вертикалі"
    },
    "hp_bars": {
        "header": "Налаштування панелі міцності команд",
        "showAliveCount": "Змінити лічильник на кількість живих",
        "style": "Стиль панелі"
    },
    "armor_calculator": {
        "header": "Налаштування калькулятора наведеної броні",
        "position*x": "Позиція по горизонталі, від центру",
        "position*y": "Позиція по вертикалі, від центру",
        "display_on_allies": "Показувати на союзниках",
        "show_piercing_power": "Показувати пробиття снаряда",
        "show_counted_armor": "Показувати броню",
        "show_piercing_reserve": "Показувати залишкове пробиття",
        "show_caliber": "Показувати калібр",
    },
    "wg_logs": {
        "header": "Налаштування історії подій WG",
        "wg_log_hide_assist": "Приховати шкоду, завдану з вашою допомогою",
        "wg_log_hide_assist_tooltip": "Приховує пошкодження по розвідданим із детальної історії подій",
        "wg_log_hide_block": "Приховати заблоковану шкоду",
        "wg_log_hide_block_tooltip": "Приховує заблоковане пошкодження із детальної історії подій",
        "wg_log_hide_critics": "Приховати критичні влучання без шкоди",
        "wg_log_hide_critics_tooltip": "Приховує критичні попадання із детальної історії подій",
        "wg_log_pos_fix": "Поставити історію на правильні місця (як в старих модах)",
        "wg_log_pos_fix_tooltip": "Міняє місцями історію подій отриманого й нанесеного/отриманого пошкодження."
    },
    "log_total": {
        "header": "Налаштування сумарної ефективності гравця",
        "settings*inCenter": "Відображати лог у центрі екрану",
        "settings*x": "Позиція основного лога по горизонталі",
        "settings*y": "Позиція основного лога по вертикалі",
        "settings*align": "Вирівнювання тексту:",
        "settings*align_tooltip": "left - зліва<br>center - по центру<br>right - справа",
        "mainLogScale": "Масштабування лога"
    },
    "log_extended": {
        "header": "Налаштування історії докладної шкоди",
        "logsAltMode_hotkey": "Перемикання історії шкоди у додатковий режим",
        "settings*x": "Позиція детальної шкоди по горизонталі",
        "settings*x_tooltip": "Від місця WG лога.",
        "settings*y": "Позиція детальної шкоди по вертикалі",
        "settings*y_tooltip": "Від місця WG лога.",
        "settings*align": "Вирівнювання тексту:",
        "settings*align_tooltip": "left - зліва<br>center - по центру<br>right - справа",
        "reverse": "Додавати нові події на початок",
        "reverse_tooltip": "Додавати новий рядок на початок історії",
        "shellColor*gold": "Колір преміум снарядів",
        "shellColor*normal": "Колір снарядів",
        "top_enabled": "Детальна історія завданої шкоди",
        "bottom_enabled": "Детальна історія отриманої шкоди",
    },
    "main_gun": {
        "header": "Налаштування медалі Основний калібр",
        "x": "Позиція по горизонталі (від центру екрана)",
        "y": "Позиція по вертикалі (від верхнього краю)",
        "progress_bar": "Смуга прогресу"
    },
    "team_bases_panel": {
        "header": "Налаштування індикатора захоплення бази",
        "y": "Позиція смуги захоплення по вертикалі",
        "width": "Ширина смуги у пікселях",
    },
    "vehicle_types_colors": {
        "header": "Налаштування кольорів класів техніки",
        "AT-SPG": "ПТ-САУ (Протитанкові САУ)",
        "SPG": "САУ (Артилерія)",
        "heavyTank": "Важкий танк",
        "lightTank": "Легкий танк",
        "mediumTank": "Середній танк",
        "unknown": "Невідомо (Глобальна мапа)"
    },
    "players_panels": {
        "header": "Налаштування панелей зі списком гравців",
        "players_damages_enabled": "Завдана гравцями шкода",
        "players_damages_hotkey": "Клавіша для відображення завданої шкоди",
        "players_damages_settings*x": "Позиція тексту по горизонталі",
        "players_damages_settings*y": "Позиція тексту по вертикалі",
        "players_bars_enabled": "Відображати міцність машин",
        "players_bars_hotkey": "Клавіша відображення міцності",
        "players_bars_classColor": "Пофарбувати смуги міцності у вухах по кольору типу техніки",
        "players_bars_on_key_pressed": "Відображати смуги тільки по натисканню клавіші",
        "panels_spotted_fix": "Виправити розмір й позицію індикаторів виявлення"
    },
    "zoom": {
        "header": "Налаштування режиму снайпера",
        "disable_cam_after_shot": "Вимикати режим снайпера після пострілу",
        "disable_cam_after_shot_tooltip": "Автоматично перемикає камеру в режим аркади після пострілу, "
                                          "якщо калібр гармати більше 60мм.",
        "disable_cam_after_shot_latency": "Затримка автоматичного вимкнення режиму снайпера",
        "disable_cam_after_shot_skip_clip": "Не виходити з режиму, якщо є касетна система зарядження",
        "dynamic_zoom": "Автоматичний механізм вибору кратності наближення",
        "dynamic_zoom_tooltip": "Якщо дана функція увімкнена, то <b>фіксований параметр</b> працювати не буде. "
                                "Автоматичний механізм вибору означає, що відстань до цілі в метрах ділене на "
                                "чутливість буде використовуватись для вибору кратності зуму.<br>",
        "steps_enabled": "Замінити кратності зуму",
        "steps_range": "Кроки кратності зуму",
        "steps_range_tooltip": "Кроки кратності зуму потрібно записати через кому та пробіл або лише кому. "
                               "Підтримується будь-яка кількість кроків."
    },
    "arcade_camera": {
        "header": "Налаштування командирської камери",
        "max": "Максимальне віддалення (за замовчуванням - 25)",
        "min": "Максимальне наближення (за замовчуванням - 2)",
        "startDeadDist": "Дистанція камери під час старту/знищення (за замовчуванням - 15)",
        "scrollSensitivity": "Чутливість прокрутки (за замовчуванням - 4)"
    },
    "strategic_camera": {
        "header": "Налаштування камери артилериста",
        "max": "Максимальне віддалення (за замовчуванням - 100)",
        "min": "Максимальное наближення (за замовчуванням - 40)",
        "scrollSensitivity": "Чутливість прокрутки (за замовчуванням - 10)"
    },
    "flight_time": {
        "header": "Налаштування часу польоту снаряда і відстані до цілі",
        "x": "Горизонтальне положення тексту",
        "x_tooltip": "Відстань від центру екрана по горизонталі.",
        "y": "Вертикальне положення тексту",
        "y_tooltip": "Відстань від центру екрана по вертикалі.",
        "spgOnly": "Показувати час польоту лише для артилерії",
        "align": "Вирівнювання тексту",
        "time": "Показувати час",
        "distance": "Показувати відстань",
        "color": "Колір текста"
    },
    "minimap": {
        "header": "Налаштування міні-мапи",
        "zoom": "Увімкнути збільшення міні-мапи в центр",
        "permanentMinimapDeath": "Відображати знищених на мапі",
        "showDeathNames": "Відображати назви знищених танків",
        "real_view_radius": "Дозволити коло огляду більше ніж 445м",
        "yaw_limits": "Відображати кути горизонтального наведення на всій техніці, де можливо",
        "zoom_hotkey": "Клавіша для збільшення мапи"
    },
    "colors": {
        "header": "Налаштування глобальних кольорів мода",
        "armor_calculator*green": "Наведена броня: Шанс пробиття 100%",
        "armor_calculator*orange": "Наведена броня: Шанс пробиття 50%",
        "armor_calculator*red": "Наведена броня: Шанс пробиття 0%",
        "armor_calculator*yellow": "Наведена броня: Шанс пробиття 50% (режим колірної сліпоти)",
        "armor_calculator*purple": "Наведена броня: Шанс пробиття 0% (режим колірної сліпоти)",
        "armor_calculator*normal": "Наведена броня: Рикошет або влучання без шкоди",
        "global*ally": "Глобальний колір, союзник",
        "global*bgColor": "Колір фона панелей",
        "global*enemyColorBlind": "Глобальний колір: супротивники (колірна сліпота)",
        "global*enemy": "Глобальний колір, супротивник",
        "vehicle_types_colors*AT-SPG": "ПТ-САУ (Протитанкові САУ)",
        "vehicle_types_colors*SPG": "САУ (Артилерія)",
        "vehicle_types_colors*heavyTank": "Важкий танк",
        "vehicle_types_colors*lightTank": "Легкий танк",
        "vehicle_types_colors*mediumTank": "Середній танк",
        "vehicle_types_colors*unknown": "Невідомо (Глобальна мапа)"
    },
    "service_channel_filter": {
        "header": "Налаштування фільтра повідомлень у системному каналі",
        "sys_keys*CustomizationForCredits": "Налаштування техніки за кредити",
        "sys_keys*CustomizationForGold": "Налаштування техніки за золото",
        "sys_keys*DismantlingForCredits": "Демонтування обладнання за кредити",
        "sys_keys*DismantlingForCrystal": "Демонтування обладнання за бони",
        "sys_keys*DismantlingForGold": "Демонтування обладнання за золото",
        "sys_keys*GameGreeting": "Привітання гри",
        "sys_keys*Information": "Інформаційні повідомлення",
        "sys_keys*MultipleSelling": "Продаж кількох предметів",
        "sys_keys*PowerLevel": "Дослідження модулів і техніки",
        "sys_keys*PurchaseForCredits": "Купівля за кредити",
        "sys_keys*PurchaseForCrystal": "Купівля за бони",
        "sys_keys*PurchaseForGold": "Купівля за золото",
        "sys_keys*Remove": "Видалення предмету",
        "sys_keys*Repair": "Ремонт",
        "sys_keys*Restore": "Відновлення",
        "sys_keys*Selling": "Продаж одного предмету",
        "sys_keys*autoMaintenance": "Автоматичне обслуговування техніки",
        "sys_keys*customizationChanged": "Змінення налаштунвань"
    },
    "service": {
        "name": "Battle Observer - v{0}",
        "description": "Відкрити налаштування мода Battle Observer",
        "windowTitle": "Налаштування мода Battle Observer - v{0}",
        "buttonOK": "Гаразд",
        "buttonCancel": "Скасувати",
        "buttonApply": "Застосувати",
        "enableButtonTooltip": "{HEADER}ВКЛ/ВИКЛ{/HEADER}{BODY}Увімкнути/Вимкнути модуль{/BODY}"
    },
    "sixth_sense": {
        "header": "Налаштування лампи шостого відчуття",
        "default_icon": "Використовувати вбудоване зображення.",
        "default_icon_name": "Вибрати вбудоване зображення.",
        "default_icon_tooltip": "Буде використовуватись вбудоване в мод зображення замість користувацького.",
        "lampShowTime": "Тривалість в секундах",
        "lampShowTime_tooltip": "<b>Як довго видно виявлену ціль?</b><br>Після того як промені видимості одного танку "
                                "перетнулись з оглядовими точками іншого, то перший танк буде залишатися видимим, "
                                "навіть якщо промені видимості більше не взаємодіють з оглядовими точками. Звичайний "
                                "час, протягом якого танк залишається видимим — 10 секунд, але цей час можна як "
                                "зменшити до 8, так і збільшити до 16-18 секунд в залежності від встановленого на "
                                "танк обладнання, навичок та умінь членів екіпажу, та настанов.",
        "playTickSound": "Програвати звук таймера",
        "show_timer": "Увімкнути таймер.",
        "show_timer_graphics": "Увімкнути графічний таймер.",
        "show_timer_graphics_color": "Колір графіки.",
        "show_timer_graphics_radius": "Радіус графічного кола.",
        "icon_size": "Розмір картинки в пікселях. макс 180"
    },
    "distance_to_enemy": {
        "header": "Налаштування відстані до найближчого виявленого ворога",
        "x": "Позиція тексту по горизонталі",
        "x_tooltip": "Положення від центру екрана",
        "y": "Позиція тексту по вертикалі",
        "y_tooltip": "Положення від центру екрана",
        "template": "Шаблон строки. Макроси: %(distance)s, %(name)s",
        "align": "Вирівнювання тексту"
    },
    "own_health": {
        "header": "Налаштування міцності техніки гравця",
        "x": "Позиція тексту по горизонталі",
        "x_tooltip": "Положення від центру екрана",
        "y": "Позиция тексту по вертикалі",
        "y_tooltip": "Положення від центру екрана",
    },
    "crewDialog": {
        "enable": "<br>Увімкнути пришвидшене навчання екіпажу?",
        "disable": "<br>Вимкнути пришвидшене навчання екіпажу?",
        "notAvailable": "Польова модернізація недоступна для даної техніки",
        "isFullXp": "Ви набрали необхідну кількість досвіду для повної прокачки польової модернізації",
        "isFullComplete": "Ви прокачали польову модернізацію до максимально можливого рівня",
        "needTurnOff": "У вас не прокачана польова модернізація. Рекомендовано вимкнути пришвидшене навчання екіпажу."
    },
    "excludedMaps": {
        "header": "Список виключених карт",
        "message": "Ви маєте %s доступних слотів для виключення карт.\nПерейти до вибору карт для виключення?"
    },
    "avg_efficiency_in_hangar": {
        "header": "Налаштування віджета статистики танка в гаражі",
        "avg_damage": "Показати середню завдану шкоду",
        "avg_assist": "Показати середню шкоду, завдану з вашою допомогою",
        "avg_blocked": "Показати середню заблоковану бронею шкоду",
        "avg_stun": "Показати середню шкоду цілям, екіпажі яких ви оглушили (САУ)",
        "gun_marks": "Показати відсоток відмітної позначки",
        "win_rate": "Показати відсоток перемог",
        "battles": "Показати кількість боїв"
    }
}
