# coding=utf-8
from armagomen.battle_observer import __version__

timeFormat_tooltip = ("Формат - Значення\n"
                      "%a - Скорочена назва дня тижня\n"
                      "%A - Повна назва дня тижня\n"
                      "%b - Скорочена назва місяця\n"
                      "%B - Повна назва місяця\n"
                      "%c - Дата і час\n"
                      "%d - День місяца [01,31]\n"
                      "%H - Час (24-годинний формат) [00,23]\n"
                      "%I - Час (12-годинний формат) [01,12]\n"
                      "%j - День року [001,366]\n"
                      "%m - Номер місяця [01,12]\n"
                      "%M - Число хвилин [00,59]\n"
                      "%p - До полудня або після (при 12-годинному форматі)\n"
                      "%S - Число секунд [00,61]\n"
                      "%U - Номер тижня в році (нульовий тиждень починається з неділі) [00,53]\n"
                      "%w - Номер дня тижня [0(Sunday),6]\n"
                      "%W - Номер тижня в році (нульовий тиждень починається с понеділка) [00,53]\n"
                      "%x - Дата\n"
                      "%X - Час\n"
                      "%y - Рік без століття [00,99]\n"
                      "%Y - Рік з століттям\n"
                      "%Z - Часовий пояс\n"
                      "%% - Знак '%'")

RESTART_TOOLTIP = "Для увімкнення/вимкнення необхідний перезапуск гри."

localization = {
    "configSelect": {
        "header": "Пресети налаштувань",
        "selector": "Вибрати пресет:",
        "donate_button_ua": "Підтримати розробку",
        "donate_button_paypal": "Підтримати через PayPal",
        "donate_button_patreon": "Підтримати через Patreon",
        "discord_button": "Discord сервер модифікації"
    },
    "main": {
        "header": "Налаштування без категорії",
        "DEBUG_MODE": "DEBUG_MODE",
        "showFriendsAndClanInEars": "Позначити друзів, сокланівців і себе в списках команд",
        "autoClearCache": "Очищати кеш гри після виходу",
        "autoClearCache_tooltip": "Очистка тимчасових файлів гри в папці AppData/Roaming/Wargaming.net/WorldOfTanks.\n"
                                  "Папки модифікацій і налаштування, які зберігаються в тому ж місці, залишаться.",
        "removeShadowInPrebattle": "Прибрати затемнення таймеру на початку бою",
        "hideBadges": "Вимкнути відображення нашивок в бою",
        "hideBadges_tooltip": "Вимкнення відображення нашивок в бою у вухах, у вікні по клавіші Tab та на екрані завантаження.",
        "hideClanAbbrev": "Вимкнути відображення клантегу",
        "hideClanAbbrev_tooltip": "Вимкнення відображення клантегу в бою у вухах, у вікні по клавіші Tab та на екрані завантаження.",
        "fps_enableFPSLimiter": "Увімкнути обмежувач FPS",
        "fps_enableFPSLimiter_tooltip": RESTART_TOOLTIP,
        "fps_maxFrameRate": "Максимальный FPS",
        "hideChatInRandom": "Вимкнути чат у випадкових боях",
        "hideChatInRandom_tooltip": "Повністю вимикає чат у випадкових боях.\nПрибирає форму чата і все, "
                                    "що з нею пов'язано.",
        "anonymousEnableShow": "Позначити гравців з прихованим іменем як тімкіллера (голубим кольором)",
        "anonymousEnableShow_tooltip": "!! WIP: Ukranian localization !! Только в том случае если отключена статистика игроков, параметр не будет "
                                       "учитываться если включена статистика.",
        "anonymousNameChange": "Змінити імена гравців з прихованим іменем на Anonymous",
        "useKeyPairs": "Використовувати парні Ctrl, Alt і Shift",
        "useKeyPairs_tooltip": "Після включення ліва і права клавіша буде сприйматися як одна незалежно від "
                               "того, яку ви вибрали в налаштуваннях модуля. Не відноситься до модулю мінікарти.",
        "hide_dog_tags": "Вимкнути відображення жетонів в бою",
        "ignore_commanders_voice": "Ігнорувати озвучку командирів",
        "ignore_commanders_voice_tooltip": "Після включення буде примусово використовуватися стандартна озвучка"
                                           " екіпажу. Параметр замінить всі унікальні озвучки командирів "
                                           "на стандартну або із встановленого мода на озвучку.",
        "disable_score_sound": "Вимкнути звук при знищенні союзного чи ворожого танку",
        "premium_time": "Відображати точний час дії преміум аккаунту",
        "premium_time_tooltip": "Включення або вимкнення відбувається не моментально! Потрібно зачекати до 1 "
                                "хвилини або змінити вкладку гаражу.",
        "auto_crew_training": "Автоматичне переключення галочки \"Пришвидшене навчання екіпажу\"",
        "auto_crew_training_tooltip": "Якщо \"Польова модернізація\" доступна для танка і вона не повністю прокачана, то галочка "
                                      "на екіпажі буде знята автоматично. Після її повної прокачки "
                                      "вам буде запропоновано увімкнути \"Пришвидшене навчання екіпажу\" або залишити все як є.",
        "do_not_buy_directives_for_currency_automatically": "Не поповнювати настанови за бони",
        "do_not_buy_directives_for_currency_automatically_tooltip":
            "Запобігає автоматичному поповненню настанов за бони, якщо їх не залишилось на складі. "
            "Модифікація також увімкне галочку \"Автопоповнення\" настанов у випадку, якщо їх запас є на складі, але ця галочка не увімкнена.",
        "hide_hint_panel": "Вимкнути підказки в бою",
        "hide_field_mail": "Вимкнути польову пошту",
        "auto_return_crew": "Автоматичне повернення екіпажу",
        "auto_return_crew_tooltip": "Якщо на вибраному танку відсутній екіпаж, але він в наявності і не в бою "
                                    "на іншому танку, то екіпаж буде повернений в танк автоматично.",
        "disable_stun_sound": "Вимкнути звук оглушення від артилерії",
        "hide_main_chat_in_hangar": "Вимкнути загальний чат в гаражі",
        "hide_main_chat_in_hangar_tooltip": RESTART_TOOLTIP,
        "hide_button_counters_on_top_panel": "Вимкнути лічильники та підказки на кнопках в шапці гаражу.",
        "hide_button_counters_on_top_panel_tooltip": RESTART_TOOLTIP,
    },
    "statistics": {
        "header": "Статистика гравців та іконки танків",
        "statistics_enabled": "Увімкнути статистику гравців (WTR рейтинг)",
        "statistics_change_vehicle_name_color": "Змінити колір назви танку в вухах на колір згідно з статистикою гравця",
        "statistics_enabled_tooltip": "Статистика буде відображатися на екрані завантаження, у вухах, у вікні по клавіші Tab.\n"
                                      "Для більш тонкого налаштування дивись файл statistics.json\n"
                                      "Доступні імена макросів: WTR, colorWTR, winRate, nickname, battles, clanTag",
        "icon_enabled": "Перефарбувати іконки танків в кольори класів техніки",
        "icon_enabled_tooltip": "Дана функція перефарбовує будь-які іконки техніки на екрані завантаження, у вухах, у вікні "
                                "по клавіші Tab в колір класів техніки.\nСила фільтра впливає на яскравість."
                                "\nРекомендована сила фільтра: -1.25",
        "icon_blackout": "Сила фільтра (яскравість)",
        "panels_full_width": "Ширина поля імені гравця (великі вуха)",
        "panels_cut_width": "Ширина поля імені гравця (малі вуха)",
    },
    "dispersion_circle": {
        "header": "Покращене зведення / серверний приціл",
        "circle_enabled": "Покращений круг зведення",
        "circle_use_lock_prediction": "Прилипання серверного прицілу при захваті цілі",
        "circle_extraServerLap": "Відображати серверний приціл як додатковий",
        "circle_extraServerLap_tooltip": "Добавить другий круг зведення серверного прицілу до основного.",
        "circle_replaceOriginalCircle": "Замінити оригінальный круг зведення зменшеним",
        "circle_scale": "Множник розміру круга (1 - 100 %)",
        "circle_scale_tooltip": "Даний параметр впливає на те, яким буде круг сведения у підсумку.\n"
                                "Якщо його значення становить 1%, то круг буде мінімально можливим, "
                                "а при 100% - максимально, тобто без змін. "
                                "Не рекомендується встановлювати значення менше 65%.",
        "timer_enabled": "Включити таймер зведення",
        "timer_position_x": "Позиція таймера по горизонталі",
        "timer_position_y": "Позиція таймера по вертикалі",
        "timer_color": "Колір: Не зведений",
        "timer_done_color": "Колір: Повністю зведений",
        "timer_align": "Вирівнювання тексту"
    },
    # region Part2
    "tank_carousel": {
        "header": "Налаштування каруселі танків",
        "carouselRows": "Кількість рядів каруселі танків",
        "carouselRows_tooltip": "Потребує увімкненої багаторядної каруселі в налаштуваннях гри.",
        "smallDoubleCarousel": "Примусово використовувати маленькі іконки"
    },
    "effects": {
        "header": "Налаштування візуальних ефектів",
        "noShockWave": "Прибрати потряхування камери при попаданні по танку",
        "noFlashBang": "Прибрати червоний спалах при отриманні пошкоджень",
        "noLightEffect": "Прибрати спалах і полум'я після пострілу",
        "noBinoculars": "Прибрати затемнення в снайперському режимі",
        "noSniperDynamic": "Вимкнути динамічну камеру в снайперському режимі"
    },
    "debug_panel": {
        "header": "Панель FPS та PING",
        "debugText*text": "Текстове поле форматування панелі FPS та PING",
        "debugText*text_tooltip": "Макроси для панелі FPS та PING"
                                  "\n%(PING)s <tab>Пінг"
                                  "\n%(FPS)s <tab>Поточний FPS"
                                  "\n%(fpsColor)s <tab>колір FPS"
                                  "\n%(pingColor)s <tab>колір PING/LAG."
                                  "\nПідтримується HTML.",
        "debugText*x": "Позиція панелі по горизонталі",
        "debugText*y": "Позиція панелі по вертикалі",
        "debugText*scale": "Масштаб панелі",
        "debugGraphics*enabled": "Відображати графічний індикатор FPS та PING",
        "colors*fpsColor": "Колір макроса %(fpsColor)s",
        "colors*pingColor": "Колір макроса %(pingLagColor)s - Лаги відсутні",
        "colors*pingLagColor": "Колір макроса %(pingLagColor)s - Лаги присутні",
        "debugGraphics*fpsBar*color": "Колір графічного індикатору FPS",
        "debugGraphics*fpsBar*enabled": "Відображати графічний індикатор для FPS",
        "debugGraphics*pingBar*color": "Колір графічного індикатору PING",
        "debugGraphics*pingBar*enabled": "Відображати графічний індикатор для PING"
    },
    "battle_timer": {
        "header": "Таймер бою",
        "timerTemplate": "Поле для форматування таймера",
        "timerTemplate_tooltip": "Доступні макроси:\n %(timer)s\n %(timerColor)s\nПідтримується HTML.",
        "timerColorEndBattle": "Колір макроса %(timerColor)s: залишається <= 2 хв.",
        "timerColor": "Колір макроса %(timerColor)s: звичайний"
    },
    "clock": {
        "header": "Годинник в ангарі та бою",
        "battle*enabled": "Відображати в бою",
        "hangar*enabled": "Відображати в ангарі",
        "battle*format": "Поле для форматування годинника в бою",
        "battle*format_tooltip": timeFormat_tooltip,
        "hangar*format": "Поле для форматування годинника в ангарі",
        "hangar*format_tooltip": timeFormat_tooltip,
        "battle*x": "Позиція в бою по горизонталі",
        "battle*y": "Позиція в бою по вертикалі",
        "hangar*x": "Позиція в ангарі по горизонталі",
        "hangar*y": "Позиція в ангарі по вертикалі"
    },
    "hp_bars": {
        "header": "Здоров'я команд",
        "barsWidth": "Ширина полосок",
        "differenceHP": "Показувати різницю між загальними здоров'ями команд",
        "showAliveCount": "Показувати на панелі рахунку живих",
        "style": "Стиль панелі",
        "outline*enabled": "Увімкнути контур в стилі \"normal\"",
        "outline*color": "Колір контуру",
        "markers*enabled": "Карусель маркерів техніки",
        "markers*x": "Відстань по горизонталі від центру",
        "markers*x_tooltip": "Зеркально переміщає значки від центру на задану кількість пікселів",
        "markers*y": "Позиція по вертикалі від верху",
        "markers*y_tooltip": "Позиція маркерів по вертикалі від верху экрану.",
        "markers*showMarkers_hotkey": "Клавіша увімкнення/вимкнення маркерів",
        "markers*markersClassColor": "Пофарбувати значки по кольору класу техніки"
    },
    # endregion Part2 Done
    # region Part3
    "armor_calculator": {
        "header": "Калькулятор наведеної броні",
        "position*x": "Позиція по горизонталі",
        "position*y": "Позиція по вертикалі",
        "template": "Поле для форматування",
        "display_on_allies": "Відображати на союзниках",
        "template_tooltip": "Формат макросів: %(ім'я)тип даних s:d:f.\n"
                            "s-рядок, d-десяткове число, f-число з плаваючою точкою\n\n"
                            "Список доступних макросів:\n"
                            "<li>%(countedArmor)d - Наведена броня</li>"
                            "<li>%(piercingPower)d - Пробиття снаряду з урахуванням відстані</li>"
                            "<li>%(piercingReserve)d - Запас пробиття після проходження броні</li>"
                            "<li>%(caliber)d - Калібр снаряду</li>"
                            "<li>%(message)s - Повідомлення із розділу \"messages\" в конфігураціонному файлі</li>"
                            "<li>%(ricochet)s - Повідомлення про можливий рикошет</li>"
                            "<li>%(noDamage)s - Повідомлення про те, що пошкодження не буде. Снаряд попаде в модуль оминаючи "
                            "основну броню. Гусениця без пошкоджень, колесо без пошкоджень і т.д.</li>"
                            "<li>%(color)s - колір (дивись налаштування в розділі кольорів)</li>"
    },
    # endregion Part3 Done
    "log_global": {
        "header": "Общие настройки логов",
        "logsAltmode_hotkey": "Переключение логов в альтернативный режим",
        "wg_log_hide_assist": "Скрыть урон по разведданным",
        "wg_log_hide_assist_tooltip": "Убирает урон по разведданным из детального лога WG",
        "wg_log_hide_block": "Скрыть заблокированный урон",
        "wg_log_hide_block_tooltip": "Убирает заблокированный урон из детального лога WG",
        "wg_log_hide_critics": "Скрыть критические попадания",
        "wg_log_hide_critics_tooltip": "Убирает критические попадания из детального лога WG",
        "wg_log_pos_fix": "Поставить логи WG на правильные места.",
        "wg_log_pos_fix_tooltip": "Меняет местами логи полученного и нанесённого урона.\nПолученный внизу, "
                                  "Нанесённый наверху."
    },
    "log_total": {
        "header": "СУММАРНЫЙ лог эффективности игрока",
        "settings*inCenter": "Отображать лог в центре экрана",
        "settings*x": "Позиция основного лога по Горизонтали",
        "settings*y": "Позиция основного лога по Вертикали",
        "settings*align": "Выравнивание:",
        "settings*align_tooltip": "Выравнивание:\nleft - влево\ncenter - по центру\nright - вправо",
        "mainLogScale": "Масштабирование лога."
    },
    "log_damage_extended": {
        "header": "РАСШИРЕННЫЙ лог эффективности игрока.",
        "settings*x": "Позиция детального лога по Горизонтали.",
        "settings*x_tooltip": "Относительно левого списка игроков.",
        "settings*y": "Позиция детального лога по Вертикали.",
        "settings*y_tooltip": "Относительно левого списка игроков.",
        "settings*align": "Выравнивание:",
        "settings*align_tooltip": "Выравнивание:\nleft - влево\ncenter - по центру\nright - вправо",
        "reverse": "Развернуть лог.",
        "reverse_tooltip": "Добавлять новую строку на верх лога.",
        "shellColor*gold": "Цвет типа снарядов - Золото",
        "shellColor*normal": "Цвет типа снарядов - Серебро"
    },
    "log_input_extended": {
        "header": "РАСШИРЕННЫЙ лог полученного урона.",
        "settings*x": "Позиция детального лога по Горизонтали",
        "settings*x_tooltip": "Относительно дамаг панели.",
        "settings*y": "Позиция детального лога по Вертикали",
        "settings*y_tooltip": "Относительно дамаг панели.",
        "settings*align": "Выравнивание:",
        "settings*align_tooltip": "Выравнивание:\nleft - влево\ncenter - по центру\nright - вправо",
        "reverse": "Развернуть лог",
        "reverse_tooltip": "Добавлять новую строку на верх лога.",
        "shellColor*gold": "Цвет типа снарядов - Золото",
        "shellColor*normal": "Цвет типа снарядов - Серебро"
    },
    "main_gun": {
        "header": "Oсновной калибр",
        "settings*x": "Позиция по горизонтали (от центра экрана)",
        "settings*y": "Позиция по вертикали (от верхнего края)",
        "settings*align": "Выравнивание:",
        "settings*align_tooltip": "Выравнивание:\nleft - влево\ncenter - по центру\nright - вправо"
    },
    "team_bases_panel": {
        "header": "Индикация захвата базы",
        "y": "Позиция полосы захвата по вертикали",
        "scale": "Масштабирование полос захвата",
        "boBases": "Включить полосы захвата из мода",
        "outline*enabled": "Включить контур",
        "outline*color": "Цвет контура"
    },
    "vehicle_types": {
        "header": "Цвета классов техники",
        "vehicleClassColors*AT-SPG": "Противотанковая САУ - ПТ-САУ",
        "vehicleClassColors*SPG": "Противотанковая САУ - Артиллерия",
        "vehicleClassColors*heavyTank": "Тяжёлый Танк",
        "vehicleClassColors*lightTank": "Лёгкий Танк",
        "vehicleClassColors*mediumTank": "Средний Танк",
        "vehicleClassColors*unknown": "Неизвестно (ГК)"
    },
    "players_panels": {
        "header": "Панели со списком игроков (уши).",
        "players_damages_enabled": "Урон игроков в списках команд",
        "players_damages_hotkey": "Клавиша для отображения урона",
        "players_damages_settings*x": "Положение текста по горизонтали",
        "players_damages_settings*y": "Положение текста по вертикали",
        "players_bars_enabled": "Хп игроков в ушах",
        "players_bars_settings*players_bars_bar*outline*enabled": "Включить контур",
        "players_bars_settings*players_bars_bar*outline*customColor": "Пользовательский цвет контура",
        "players_bars_settings*players_bars_bar*outline*color": "Пользовательский цвет контура",
        "players_bars_settings*players_bars_bar*outline*alpha": "Прозрачность контура",
        "players_bars_hotkey": "Клавиша отображения ХП",
        "players_bars_classColor": "Окрасить полосы ХП в ушах по цвету типа техники",
        "players_bars_on_key_pressed": "Отображать полосы только по нажатию клавиши",
        "panels_spotted_fix": "Исправить размер и позицию лампочек засвета"
    },
    "zoom": {
        "header": "Снайперский режим ZOOM-X (Динамическая кратность приближения).",
        "disable_cam_after_shot": "Отключать снайперский режим после выстрела.",
        "disable_cam_after_shot_tooltip": "Автоматически переключает камеру в аркадный режим после выстрела"
                                          " если калибр орудия больше 60мм.",
        "disable_cam_after_shot_latency": "Задержка автоматического выключения камеры.",
        "disable_cam_after_shot_skip_clip": "Не выходить если магазинная система заряжания",
        "zoomToGunMarker": "Включить приближение камеры к маркеру орудия",
        "zoomToGunMarker_tooltip": "ВКЛЮЧЕНО: приближение к маркеру орудия.\nВЫКЛЮЧЕНО: без изменений."
                                   "\n\nПростыми словами: куда дуло направлено туда и приближение, иначе"
                                   " куда камера.\nДанный режим требует привыкания. Пример использования:"
                                   " наведите прицел в небо или холм таким образом чтобы маркер орудия"
                                   " попал на препятствие (например дом на пути) но при этом прицел был не на доме,"
                                   " перейдите в снайперский режим, получите кратность приближения на"
                                   " препятствие, а не в небо и увидите как работает данный параметр на практике.",
        "dynamic_zoom*zoomXMeters": "Чувствительность приближения в метрах.",
        "dynamic_zoom*zoomXMeters_tooltip": "Автоматический выбор, это расстояние до цели в метрах деленное на "
                                            "чувствительность.\nПо умолчанию на каждые 20 метров приходится х1 "
                                            "кратности приближения, чем меньше показатель показатель чувствительности "
                                            "тем больше кратность приближения в соотношении (дистанция до "
                                            "цели/дистанция для увеличения кратности).",
        "dynamic_zoom*enabled": "Автоматический выбор кратности приближения.",
        "dynamic_zoom*steps_only": "Перемещаться только по фиксированным шагам.",
        "dynamic_zoom*enabled_tooltip": "Если данная функция включена то <b>фиксированный параметр</b> "
                                        "работать не будет.",
        "zoomSteps*enabled": "Заменить 'Шаги кратности приближения'.",
        "zoomSteps*steps": "Шаги кратности приближения.",
        "zoomSteps*steps_tooltip": "Можно записать любое количество через запятую и пробел либо просто запятую."
    },
    "arcade_camera": {
        "header": "Командирская камера (отдаление камеры).",
        "max": "Максимальное отдаление: по умолчанию 25.0",
        "min": "Максимальное приближение: по умолчанию 2.0",
        "startDeadDist": "Дистанция камеры при старте/уничтожении: по умолчанию 15",
        "scrollSensitivity": "Чувствительность прокрутки, по умолчанию 4"
    },
    "strategic_camera": {
        "header": "Артиллерийская камера (отдаление камеры).",
        "max": "Максимальное отдаление камеры: по умолчанию 100.0",
        "min": "Максимальное приближение камеры: по умолчанию 40.0",
        "scrollSensitivity": "Чувствительность прокрутки, по умолчанию 10"
    },
    "flight_time": {
        "header": "Время полета снаряда / Дистанция до цели.",
        "x": "Позиция текста по Горизонтали",
        "x_tooltip": "Положение от центра экрана. Выравнивание текста ---|центр|---",
        "y": "Позиция текста по Вертикали",
        "y_tooltip": "Положение от центра экрана.",
        "spgOnly": "Отображать время полёта только на арте.",
        "template": "Шаблон строки. Макросы: %(flightTime).1f , %(distance).1f",
        "wgDistDisable": "Скрыть базовую дистанцию в прицеле.",
        "align": "Выравнивание текста."
    },
    "save_shoot": {
        "header": "Блокировка выстрелов по союзникам и уничтоженным (save shoot lite).",
        "block_on_destroyed": "Заблокировать выстрел по уничтоженным.",
        "msg": "Сообщение о успешной блокировке, видно только вам.",
        "msg_tooltip": "Данное сообщение отображается только в случае блокировки выстрела по союзнику."
    },
    "minimap": {
        "header": "Мини-Карта.",
        "zoom": "Включить увеличение мини карты в центр.",
        "permanentMinimapDeath": "Всегда показывать уничтоженных на карте",
        "showDeathNames": "Отображать имена уничтоженных танков",
        "real_view_radius": "Убрать ограничение круга обзора 445м",
        "yaw_limits": "Углы Горизонтальной Наводки на всей технике где они есть",
        "zoom_hotkey": "Клавиша для увеличения карты."
    },
    "shadow_settings": {
        "header": "Настройка теней текста (свечения).",
        "inner": "Определяет, является ли свечение внутренним свечением.",
        "knockout": "Определяет, применяется ли к объекту эффект выбивки.",
        "blurX": "Степень размытия по горизонтали.",
        "blurY": "Степень размытия по вертикали.",
        "alpha": "Значение альфа-прозрачности цвета.",
        "color": "Цвет тени/свечения.",
        "strength": "Степень вдавливания или нанесения.",
        "blurY_tooltip": "Значения, являющиеся степенью 2 (т. е. 2, 4, 8, 16 и 32), оптимизируются и выполняются "
                         "быстрее, чем остальные.",
        "blurX_tooltip": "Значения, являющиеся степенью 2 (т. е. 2, 4, 8, 16 и 32), оптимизируются и выполняются "
                         "быстрее, чем остальные.",
        "inner_tooltip": "Значение 'Включено' говорит о том, что свечение внутреннее. "
                         "Значение 'Выключено' задает внешнее свечение (свечение вокруг внешнего контура объекта).",
        "knockout_tooltip": "Значение 'Включено' делает заливку объекта прозрачной и делает видимым цвет фона "
                            "документа. Значение по умолчанию — 'Выключено' (без эффекта выбивки).",
        "strength_tooltip": "Чем выше значение, тем более насыщен цвет тени и тем сильнее контраст между свечением и "
                            "фоном. Действительны значения от 0 до 255. По умолчанию — 2."
    },
    "colors": {
        "header": "Глобальные настройки цветов.",
        "armor_calculator*green": "Приведенная броня: Пробитие 100%",
        "armor_calculator*orange": "Приведенная броня: Пробитие 50%",
        "armor_calculator*red": "Приведенная броня: Пробитие 0%",
        "armor_calculator*yellow": "Приведенная броня: Пробитие 50% (Режим цветовой слепоты)",
        "armor_calculator*purple": "Приведенная броня: Пробитие 0% (Режим цветовой слепоты)",
        "main_gun*mainGunColor": "Основной калибр: Цвет макроса %(mainGunColor)s",
        "global*ally": "Глобальный цвет: союзники",
        "global*bgColor": "Цвет фона панелей",
        "global*enemyColorBlind": "Глобальный цвет: противник - цветовая слепота",
        "global*enemy": "Глобальный цвет: противник",
        "global*alpha": "Прозрачность панелей",
        "global*alpha_tooltip": "0 - прозрачно полностью.\n1 - не прозрачно.",
        "global*bgAlpha": "Прозрачность фона панелей",
        "global*bgAlpha_tooltip": "0 - прозрачно полностью.\n1 - не прозрачно.",
        "global*deadColor": "Глобальный цвет: уничтоженный",
    },
    "service_channel_filter": {
        "header": "Фильтр сообщений в системном канале - (скрывает сообщения выбранных категорий).",
        "sys_keys*CustomizationForCredits": "Кастомизация техники за кредиты",
        "sys_keys*CustomizationForGold": "Кастомизация техники за золото",
        "sys_keys*DismantlingForCredits": "Демонтаж оборудования за кредиты",
        "sys_keys*DismantlingForCrystal": "Демонтаж оборудования за боны",
        "sys_keys*DismantlingForGold": "Демонтаж оборудования за золото",
        "sys_keys*GameGreeting": "Приветствие игры",
        "sys_keys*Information": "Информационные сообщения",
        "sys_keys*MultipleSelling": "Продажа, много предметов (со склада)",
        "sys_keys*PowerLevel": "Исследование модулей и техники",
        "sys_keys*PurchaseForCredits": "Покупки за кредиты",
        "sys_keys*PurchaseForCrystal": "Покупки за боны",
        "sys_keys*PurchaseForGold": "Покупки за золото",
        "sys_keys*Remove": "Удаление предмета",
        "sys_keys*Repair": "Ремонт (ручной режим)",
        "sys_keys*Restore": "Восстановление",
        "sys_keys*Selling": "Продажа, один предмет",
        "sys_keys*autoMaintenance": "Автоматическое обслуживание техники",
        "sys_keys*customizationChanged": "Смена кастомизации"
    },
    "service": {
        "name": "Battle Observer - v{0}".format(__version__),
        "description": "Відкрити налаштування мода Battle Observer",
        "windowTitle": "Налаштування мода Battle Observer - v{0}".format(__version__),
        "buttonOK": "OK",
        "buttonCancel": "Відміна",
        "buttonApply": "Застосувати",
        "enableButtonTooltip": "{HEADER}ВКЛ/ВИКЛ{/HEADER}{BODY}Увімкнути/Вимкнути модуль{/BODY}"
    },
    "sixth_sense": {
        "header": "Лампа 6-е чувство.",
        "showTimer": "Отображать таймер.",
        "lampShowTime": "Длительность в секундах.",
        "lampShowTime_tooltip": "<b>Как долго видна обнаруженная цель?</b>\nПосле того как лучи видимости одного "
                                "танка пересеклись с обзорными точками другого, первый танк будет оставаться видимым, "
                                "даже если лучи видимости больше не взаимодействуют с обзорными точками. Обычное время "
                                "в течении которого танк остаётся видимым — 10 секунд, но это время можно как "
                                "уменьшить до 8, так и увеличить до 16-18 секунд, в зависимости от установленного на "
                                "танк оборудования, навыков/умений членов экипажа, предбоевых инструкций.",
        "playTickSound": "Воспроизводить звук таймера."
    },
    "distance_to_enemy": {
        "header": "Дистанция до ближайшего засвеченного врага.",
        "x": "Позиция текста по Горизонтали",
        "x_tooltip": "Положение от центра экрана. Выравнивание текста ---|центр|---",
        "y": "Позиция текста по Вертикали",
        "y_tooltip": "Положение от центра экрана.",
        "template": "Шаблон строки. Макросы: %(distance)s, %(name)s",
        "align": "Выравнивание текста."
    },
    "own_health": {
        "header": "Прочность машины игрока",
        "x": "Позиция текста по Горизонтали",
        "x_tooltip": "Положение от центра экрана. Выравнивание текста ---|центр|---",
        "y": "Позиция текста по Вертикали",
        "y_tooltip": "Положение от центра экрана.",
        "template": "Шаблон строки. Макросы: %(cur_health)s, %(max_health)s, %(per_health)s",
        "align": "Выравнивание текста",
        "spottedOnly": "Информация только по обнаруженным противникам."
    },
    "crewDialog": {
        "enable": "Включить ускоренное обучение экипажа?",
        "disable": "Отключить ускоренное обучение экипажа?",
        "notAvailable": "Полевая модернизация недоступна для данной техники.",
        "isFullXp": "Вы набрали необходимое кол-во опыта для полной прокачки полевой модернизации.",
        "isFullComplete": "Вы прокачали полевую модернизацию до максимально возможного уровня.",
        "needTurnOff": "У вас не прокачана полевая модернизация, рекомендуется отключить ускоренное обучение экипажа."
    },
}
